tap "hashicorp/tap"
tap "homebrew/command-not-found"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazynpm"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Image previews for lf file manager
brew "ctpv"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage your GnuPG keys with ease!
brew "gpg-tui"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Package manager for the Lua programming language
brew "luarocks"
# Scalable distributed version control system
brew "mercurial"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk@17"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Upgrade all the things
brew "topgrade"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Terraform
brew "hashicorp/tap/terraform"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazynpm/lazynpm"
vscode "alexkrechik.cucumberautocomplete"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hediet.vscode-drawio"
vscode "kamikillerto.vscode-colorize"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "ozaki.markdown-github-dark"
vscode "sndst00m.markdown-github-dark-pack"
vscode "steoates.autoimport"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"
