# ---------------------------------------------------------------
# Required dependencies to setup the repo
# ---------------------------------------------------------------
# LastPass command-line interface tool
brew "lastpass-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Lightweight and flexible command-line JSON processor
brew "jq"

# ---------------------------------------------------------------
# Programming languages
# ---------------------------------------------------------------
# Fast and simple Node.js version manager
brew "fnm"
# Manage your Java environment
brew "jenv"
# Development kit for the Java programming language
brew "openjdk@17"
# Rust toolchain installer
brew "rustup-init"
# Package manager for the Lua programming language
brew "luarocks"

# ---------------------------------------------------------------
# Git
# ---------------------------------------------------------------
# Distributed revision control system
brew "git"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GitHub command-line tool
brew "gh"
# Defines a standard way of committing rules and communicating it
brew "commitizen"

# ---------------------------------------------------------------
# VSCode
# ---------------------------------------------------------------
vscode "alexkrechik.cucumberautocomplete"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hediet.vscode-drawio"
vscode "kamikillerto.vscode-colorize"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "ozaki.markdown-github-dark"
vscode "sndst00m.markdown-github-dark-pack"
vscode "steoates.autoimport"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"

# ---------------------------------------------------------------
# Neovim
# ---------------------------------------------------------------
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Scalable distributed version control system
brew "mercurial"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# ---------------------------------------------------------------
# Lazy Suite
# ---------------------------------------------------------------
# A simple terminal UI for docker, written in Go
tap "jesseduffield/lazydocker"
brew "jesseduffield/lazydocker/lazydocker"
# A simple terminal UI for git commands, written in Go
tap "jesseduffield/lazynpm"
brew "jesseduffield/lazynpm/lazynpm"
# Simple terminal UI for git commands
brew "lazygit"

# ---------------------------------------------------------------
# Daily tools
# ---------------------------------------------------------------
# Simple, fast and user-friendly alternative to find
brew "fd"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Upgrade all the things
brew "topgrade"
# Yet another cross-platform graphical process/system monitor
brew "bottom"

# ---------------------------------------------------------------
# Shell
# ---------------------------------------------------------------
{{- if not (contains "zsh" (env "SHELL")) }}
# UNIX shell (command interpreter)
brew "zsh"
{{ end -}}

tap "homebrew/command-not-found"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Modern, maintained replacement for ls
brew "eza"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Cross-shell prompt for astronauts
brew "starship"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# ---------------------------------------------------------------
# Misc
# ---------------------------------------------------------------
# Internet file retriever
brew "wget"
# Official Amazon AWS command-line interface
brew "awscli"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Terminal file manager
brew "lf"
# Image previews for lf file manager
brew "ctpv"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"

{{ if eq .chezmoi.os "darwin" }}
# MacOS
# ---------------------------------------------------------------
tap "buo/cask-upgrade"
cask "font-hack-nerd-font"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser
cask "google-chrome"
# Keyboard customizer
cask "karabiner-elements"
# Snippet management app
cask "lepton"
# Web browser
cask "microsoft-edge"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# GPU-based terminal emulator
cask "kitty"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Mac App Store command-line interface
brew "mas"
mas "Numbers", id: 409203825
{{ end -}}
